app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", "1"]]
---
      <%= f.text_field 'search[value]' %>
      <%= f.select 'search[model]', options_for_select({ "User" => "user", "Book" => "book" }) %>