app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @newbook = Book.new
      @book = Book.find(params[:id])

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "d"], ["body", "d"], ["created_at", "2021-08-05 05:56:11.371295"], ["updated_at", "2021-08-05 05:56:11.371295"], ["user_id", "1"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
      @newbook = Book.new(book_params)
      @newbook.user_id = current_user.id
      if @newbook.save
        flash[:notice] = "Posted successfully"
        redirect_to book_path(@newbook.id)
      else
        @books = Book.all
        @user = User.find(current_user.id)

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def index
      @books = Book.all
      @newbook = Book.new
      @user = User.find(current_user.id)