app/controllers/users_controller.rb

  def index
    @users = User.all
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]